app/controllers/categories_controller.rb

  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("category", "created_at", "updated_at") VALUES (?, ?, ?)  [["category", "Nem"], ["created_at", "2021-12-02 08:39:54.101812"], ["updated_at", "2021-12-02 08:39:54.101812"]]