app/controllers/products_controller.rb

SELECT "products".* FROM "products"
SELECT COUNT(*) FROM "products"
SELECT "products".* FROM "products" ORDER BY "products"."id" ASC LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def index
    search_result = Product.search (params[:term])
    if search_result && search_result.length > 0
      @products = search_result
    else
      @products = Product.order(id: :asc).paginate(:page => params[:page], :per_page => 5)
    end

    if session[:user_id]
      @user = User.find(session[:user_id])

INSERT INTO "products" ("id", "sku", "title", "price", "quantity", "image_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

UPDATE "products" SET "sku" = ?, "updated_at" = ? WHERE "products"."sku" = ?  [["sku", 0], ["updated_at", "2021-11-17 08:10:11.743948"], ["sku", 0]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)