app/controllers/registrations_controller.rb

INSERT INTO "users" ("email", "password_digest", "birth", "phone", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
    def create
       @user = User.new(user_params)
        if @user.save