app/models/product.rb

  def self.search(term)
    res = []
    if term && !term.empty?
      res << Product.find_by(title: term)
---
SELECT "products".* FROM "products" WHERE "products"."title" = ? LIMIT ?  [["title", "Nem lụi nướng mía"], ["LIMIT", 1]]